Repository: leehyukshuai/Meow-Box
Catalog: src/MeowBox.Controller/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# Battery.Status.NotElevated
source: The worker did not enter elevated mode.
zh_cn: 后台服务未进入管理员模式。

# Battery.Status.Reading
source: Reading battery controls...
zh_cn: 正在读取电池控制……

# Battery.Status.UpdatingPerformance
source: Updating performance mode...
zh_cn: 正在切换性能模式……

# Battery.Status.CouldNotChangePerformance
source: Could not change the performance mode.
zh_cn: 无法切换性能模式。

# Battery.Status.PerformanceUpdated
source: Performance mode updated.
zh_cn: 性能模式已更新。

# Battery.Status.UpdatingCharge
source: Updating charge limit...
zh_cn: 正在切换充电限制……

# Battery.Status.CouldNotChangeCharge
source: Could not change the charge limit.
zh_cn: 无法切换充电限制。

# Battery.Status.ChargeUpdated
source: Charge limit updated.
zh_cn: 充电限制已更新。

# Battery.Status.WaitingReport
source: Waiting for the background service to report the current power status...
zh_cn: 正在等待后台服务上报当前电源状态……

# Battery.Status.Stopping
source: The background service is stopping...
zh_cn: 后台服务正在停止……

# Battery.Status.NeedAdmin
source: Restart the background service with admin rights to view or change the current power status.
zh_cn: 请以管理员权限重新启动后台服务，才能查看或修改当前电源状态。

# Battery.Status.CouldNotRead
source: Could not read the battery controls.
zh_cn: 无法读取电池控制。

# Battery.Status.Connected
source: Connected to low-level battery controls.
zh_cn: 已连接到底层电池控制。

# Battery.Status.NotSupported
source: This device does not expose the required battery controls.
zh_cn: 这台设备没有暴露所需的电池控制接口。

# ServiceStatusShort.Running
source: Running
zh_cn: 运行中

# ServiceStatusShort.Starting
source: Starting
zh_cn: 启动中

# ServiceStatusShort.Stopping
source: Stopping
zh_cn: 停止中

# ServiceStatusShort.WorkerStopped
source: Worker stopped
zh_cn: 后台已停止运行

# ServiceStatusShort.Stopped
source: Stopped
zh_cn: 已停止

# Battery.Runtime.Preparing
source: Preparing admin runtime...
zh_cn: 正在准备管理员后台……

# Battery.Runtime.NotRunning
source: Background service is not running.
zh_cn: 后台服务未运行。

# Battery.Runtime.WorkerStarting
source: Worker is starting...
zh_cn: 后台服务启动中。

# Battery.Runtime.WorkerStopping
source: Worker is stopping...
zh_cn: 后台服务停止中。

# Battery.Runtime.NeedsAdmin
source: Background service needs admin rights.
zh_cn: 后台服务需要管理员权限。

# Battery.Runtime.WaitingStatus
source: Waiting for current power status...
zh_cn: 正在等待当前电源状态……

# Battery.Runtime.AdminActive
source: Admin runtime is active.
zh_cn: 管理员后台已启用。

# Battery.Runtime.AdminInactive
source: Admin runtime is inactive.
zh_cn: 管理员后台尚未启用。

# Battery.Error.Failed
source: Battery controls failed
zh_cn: 电池控制失败

# Battery.Error.CouldNotChangePerformance
source: Could not change performance mode
zh_cn: 无法切换性能模式

# Battery.Error.CouldNotChangeCharge
source: Could not change charge limit
zh_cn: 无法切换充电限制

# Error.UIThread
source: Could not switch to the UI thread.
zh_cn: 无法切换到 UI 线程。

# Touchpad.SettingsFailed.Title
source: Touchpad settings failed
zh_cn: 触控板设置失败

# Touchpad.Pressure.Format
source: Pressure: {0}
zh_cn: 压力：{0}

# Key.Unnamed
source: Unnamed key
zh_cn: 未命名按键

# Worker.DeviceNotSupported
source: The device does not expose the performance mode controls.
zh_cn: 设备没有暴露性能模式控制接口。

# TouchpadItem.Content
source: Touch
zh_cn: 触控板

# BatteryItem.Content
source: Battery
zh_cn: 电池

# SettingsItem.Content
source: Settings
zh_cn: 设置

# PerformanceStartupResetLabelTextBlock.Text
source: Switch to Smart mode on startup
zh_cn: 启动时切换到智能模式

# ChargeStartupResetLabelTextBlock.Text
source: Disable charge limit protection on startup
zh_cn: 启动时关闭充电限制保护

# MappingEnabledToggleSwitch.Header
source: Enabled
zh_cn: 启用

# TouchpadLongPress500Item.Content
source: 500 ms
zh_cn: 500 毫秒

# TouchpadLongPress600Item.Content
source: 600 ms
zh_cn: 600 毫秒

# TouchpadLongPress700Item.Content
source: 700 ms
zh_cn: 700 毫秒

# TouchpadLongPress800Item.Content
source: 800 ms
zh_cn: 800 毫秒

# TouchpadLongPress900Item.Content
source: 900 ms
zh_cn: 900 毫秒

# TouchpadLongPress1000Item.Content
source: 1000 ms
zh_cn: 1000 毫秒
